'''
Дан произвольный список. Вывести на экран в обратном порядке. 
Задачу решить 2мя способами. 
'''
a = input().split()
print(a[::-1])
a.reverse()
print(a)