'''
Написать функцию, которая вычисляет  факториал переданного в нее числа без рекурсии.

'''
def factorial(n:int):
    a = 1
    if True:
        for i in range (1, n+1):
            a *= i
        return a
    
print(factorial(0))

#проверить через трай экспет больше 0
        

    
